Blinkinlabs/ch554_sdcc/examples/usb_spi_flash/main.c
    }
}
/*******************************************************************************
* Function Name  : Uart1_ISR()
* Description    : 串口接收中断函数，实现循环缓冲接收
*******************************************************************************/
void Uart1_ISR(void) __interrupt (INT_NO_UART1)
{
    if(U1RI)   //收到数据
    {
        Receive_Uart_Buf[Uart_Input_Point++] = SBUF1;
        UartByteCount++;                    //当前缓冲区剩余待取字节数
        if(Uart_Input_Point>=UART_REV_LEN)
            Uart_Input_Point = 0;           //写入指针
        U1RI =0;
    }

}


//主函数
main()
{
    uint8_t length;
    uint8_t Uart_Timeout = 0;
    CfgFsys( );                                                           //CH559时钟选择配置
    mDelaymS(5);                                                          //修改主频等待内部晶振稳定,必加
    mInitSTDIO( );                                                        //串口0,可以用于调试
    UART1Setup( );                                                        //用于CDC

    setup();

#ifdef DE_PRINTF
    printf("start ...\n");
#endif
    USBDeviceCfg();
    USBDeviceEndPointCfg();                                               //端点配置
    USBDeviceIntCfg();                                                    //中断初始化
    UEP0_T_LEN = 0;
    UEP1_T_LEN = 0;                                                       //预使用发送长度一定要清空
    UEP2_T_LEN = 0;                                                       //预使用发送长度一定要清空

    while(1)
    {
        if(UsbConfig)
        {
            if(USBByteCount)   //USB接收端点有数据
            {
                //CH554UART1SendByte(Ep2Buffer[USBBufOutPoint++]);
                handleRx(Ep2Buffer[USBBufOutPoint++]);
                USBByteCount--;
                if(USBByteCount==0)
                    UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_R_RES | UEP_R_RES_ACK;

            }
            if(UartByteCount)
                Uart_Timeout++;
            if(!UpPoint2_Busy)   //端点不繁忙（空闲后的第一包数据，只用作触发上传）
            {
                length = UartByteCount;
                if(length>0)
                {
                    if(length>39 || Uart_Timeout>100)
                    {
                        Uart_Timeout = 0;
                        if(Uart_Output_Point+length>UART_REV_LEN)
                            length = UART_REV_LEN-Uart_Output_Point;
                        UartByteCount -= length;
                        //写上传端点
                        memcpy(Ep2Buffer+MAX_PACKET_SIZE,&Receive_Uart_Buf[Uart_Output_Point],length);
                        Uart_Output_Point+=length;
                        if(Uart_Output_Point>=UART_REV_LEN)
                            Uart_Output_Point = 0;
                        UEP2_T_LEN = length;                                                    //预使用发送长度一定要清空
                        UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_ACK;            //应答ACK
                        UpPoint2_Busy = 1;
                    }
                }
            }
        }
    }
}
